In [1]:
import pandas as pd
import numpy as np

C:\Users\user\AppData\Local\Temp\ipykernel_9500\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
dict1 = {
    'name': ['Ashish', 'Harry', 'Rohan', 'Subh'],
    'salary': [92, 34, 24, 17],
    'city': ['Rampur', 'Kolkata', 'Jaipur', 'Patna']
}

In [3]:
df = pd.DataFrame(dict1)

In [5]:
df

     name  salary     city
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [10]:
df.to_csv('../../data_folder/s1/friendss1.csv')

In [11]:
df.to_csv('../../data_folder/s1/friendss1_without_index.csv', index=False)

In [12]:
df.head()

     name  salary     city
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [13]:
df.head(2)

     name  salary     city
0  Ashish      92   Rampur
1   Harry      34  Kolkata

In [14]:
df.tail()

     name  salary     city
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [15]:
df.tail(2)

    name  salary    city
2  Rohan      24  Jaipur
3   Subh      17   Patna

In [16]:
df.describe()

         salary
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [17]:
df = pd.read_csv('../../data_folder/ashish.csv')

In [18]:
df

   Train  Speed     City
0    123     12   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [20]:
df['Speed']

0    12
1    23
2    34
3    45
Name: Speed, dtype: int64

In [26]:
df['Speed'][0]

50

In [27]:
df['Speed'][0] = 50

C:\Users\user\AppData\Local\Temp\ipykernel_9500\2609676089.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Speed'][0] = 50

In [28]:
df

   Train  Speed     City
0    123     50   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [29]:
df.to_csv('../../data_folder/s1/updated_ashish.csv', index=False)

In [30]:
# code to change the index of an existing dataframe.
df.index = ['First', 'Second', 'Third', 'Fourth']

In [31]:
df

        Train  Speed     City
First     123     50   Rampur
Second    456     23  Kolkata
Third     789     34   Jaipur
Fourth     12     45    Patna

In [34]:
# code to generate a one dimensional df called series.
df = pd.Series(np.random.rand(34))

In [35]:
df

0     0.456570
1     0.032459
2     0.271330
3     0.492638
4     0.293871
5     0.305626
6     0.674065
7     0.679297
8     0.012257
9     0.688787
10    0.300811
11    0.614061
12    0.839056
13    0.138743
14    0.412073
15    0.833933
16    0.457666
17    0.834770
18    0.659865
19    0.585819
20    0.361878
21    0.147258
22    0.312089
23    0.675663
24    0.995818
25    0.274653
26    0.647586
27    0.680378
28    0.494701
29    0.015589
30    0.884326
31    0.222888
32    0.682671
33    0.250138
dtype: float64

In [36]:
type(df)

pandas.core.series.Series

In [37]:
new_df = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [38]:
new_df

            0         1         2         3         4
0    0.428177  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3    0.503090  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [39]:
new_df.head()

          0         1         2         3         4
0  0.428177  0.582689  0.586726  0.972259  0.002079
1  0.192804  0.440983  0.033614  0.968491  0.237070
2  0.485397  0.128921  0.705564  0.628725  0.961703
3  0.503090  0.365278  0.205673  0.745782  0.672435
4  0.954185  0.973301  0.215371  0.108087  0.927983

In [40]:
new_df.head(10)

          0         1         2         3         4
0  0.428177  0.582689  0.586726  0.972259  0.002079
1  0.192804  0.440983  0.033614  0.968491  0.237070
2  0.485397  0.128921  0.705564  0.628725  0.961703
3  0.503090  0.365278  0.205673  0.745782  0.672435
4  0.954185  0.973301  0.215371  0.108087  0.927983
5  0.871531  0.563333  0.038668  0.503785  0.032088
6  0.071561  0.094675  0.133739  0.961463  0.443363
7  0.695372  0.919335  0.160676  0.893612  0.279080
8  0.727041  0.763729  0.894074  0.005759  0.914290
9  0.347531  0.981218  0.317295  0.863702  0.271166

In [41]:
type(new_df)

pandas.core.frame.DataFrame

In [42]:
new_df.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.506604    0.521251    0.507832    0.490900    0.496190
std      0.293578    0.283465    0.303027    0.301809    0.298947
min      0.001853    0.006157    0.002890    0.001094    0.001906
25%      0.256229    0.278773    0.255765    0.227321    0.229471
50%      0.529122    0.559906    0.483539    0.489943    0.494778
75%      0.752243    0.757585    0.780456    0.744354    0.760423
max      0.998721    0.999056    0.997593    0.999446    0.998098

In [43]:
new_df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [44]:
new_df[0][0] = 'Ashish'

C:\Users\user\AppData\Local\Temp\ipykernel_9500\3256049214.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_df[0][0] = 'Ashish'
C:\Users\user\AppData\Local\Temp\ipykernel_9500\3256049214.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Ashish' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  new_df[0][0] = 'Ashish'

In [45]:
new_df

            0         1         2         3         4
0      Ashish  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [46]:
new_df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [47]:
# Check the index.
new_df.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [48]:
# check the columns
new_df.columns

RangeIndex(start=0, stop=5, step=1)

In [51]:
# code to convert a dataframe into numpy array
new_df.to_numpy()

array([['Ashish', 0.5826891028989527, 0.5867259883572156,
        0.9722590413116907, 0.0020791514249712817],
       [0.1928038398688422, 0.4409830215985098, 0.03361371122245049,
        0.9684905887020318, 0.23707002135167865],
       [0.4853965231344084, 0.1289207352678967, 0.7055640012539106,
        0.6287249298947586, 0.9617026838535825],
       ...,
       [0.7521560681671026, 0.49965976424878056, 0.2796003646212303,
        0.1789823646276506, 0.6080059474864472],
       [0.55480861412492, 0.7079825413070173, 0.9747372584095345,
        0.4157709032589999, 0.6574100912538943],
       [0.284958858834497, 0.10844024257345897, 0.6196184584666131,
        0.7044776009728426, 0.8169384023525645]], dtype=object)

In [52]:
new_df[0][0] = 2.3

In [53]:
new_df

            0         1         2         3         4
0         2.3  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [55]:
new_df.to_numpy()

array([[2.3, 0.5826891028989527, 0.5867259883572156, 0.9722590413116907,
        0.0020791514249712817],
       [0.1928038398688422, 0.4409830215985098, 0.03361371122245049,
        0.9684905887020318, 0.23707002135167865],
       [0.4853965231344084, 0.1289207352678967, 0.7055640012539106,
        0.6287249298947586, 0.9617026838535825],
       ...,
       [0.7521560681671026, 0.49965976424878056, 0.2796003646212303,
        0.1789823646276506, 0.6080059474864472],
       [0.55480861412492, 0.7079825413070173, 0.9747372584095345,
        0.4157709032589999, 0.6574100912538943],
       [0.284958858834497, 0.10844024257345897, 0.6196184584666131,
        0.7044776009728426, 0.8169384023525645]], dtype=object)

In [56]:
# code to transpose a dataframe
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,2.3,0.192804,0.485397,0.50309,0.954185,0.871531,0.071561,0.695372,0.727041,0.347531,...,0.304716,0.138592,0.863832,0.926544,0.998721,0.502039,0.968483,0.752156,0.554809,0.284959
1,0.582689,0.440983,0.128921,0.365278,0.973301,0.563333,0.094675,0.919335,0.763729,0.981218,...,0.360999,0.799727,0.896571,0.98468,0.175453,0.173063,0.815929,0.49966,0.707983,0.10844
2,0.586726,0.033614,0.705564,0.205673,0.215371,0.038668,0.133739,0.160676,0.894074,0.317295,...,0.60562,0.159117,0.83787,0.979826,0.193596,0.420129,0.321769,0.2796,0.974737,0.619618
3,0.972259,0.968491,0.628725,0.745782,0.108087,0.503785,0.961463,0.893612,0.005759,0.863702,...,0.155583,0.515144,0.676665,0.022515,0.126226,0.652737,0.288891,0.178982,0.415771,0.704478
4,0.002079,0.23707,0.961703,0.672435,0.927983,0.032088,0.443363,0.27908,0.91429,0.271166,...,0.698691,0.794229,0.658742,0.513595,0.191829,0.513331,0.06765,0.608006,0.65741,0.816938

In [57]:
new_df.head()

          0         1         2         3         4
0       2.3  0.582689  0.586726  0.972259  0.002079
1  0.192804  0.440983  0.033614  0.968491  0.237070
2  0.485397  0.128921  0.705564  0.628725  0.961703
3   0.50309  0.365278  0.205673  0.745782  0.672435
4  0.954185  0.973301  0.215371  0.108087  0.927983

In [59]:
# code to sort the dataframe as per index in the descending order.
new_df.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.284959  0.108440  0.619618  0.704478  0.816938
332  0.554809  0.707983  0.974737  0.415771  0.657410
331  0.752156  0.499660  0.279600  0.178982  0.608006
330  0.968483  0.815929  0.321769  0.288891  0.067650
329  0.502039  0.173063  0.420129  0.652737  0.513331
..        ...       ...       ...       ...       ...
4    0.954185  0.973301  0.215371  0.108087  0.927983
3     0.50309  0.365278  0.205673  0.745782  0.672435
2    0.485397  0.128921  0.705564  0.628725  0.961703
1    0.192804  0.440983  0.033614  0.968491  0.237070
0         2.3  0.582689  0.586726  0.972259  0.002079

[334 rows x 5 columns]

In [60]:
# code to sort the dataframe as per columns in descending order.
new_df.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.002079  0.972259  0.586726  0.582689       2.3
1    0.237070  0.968491  0.033614  0.440983  0.192804
2    0.961703  0.628725  0.705564  0.128921  0.485397
3    0.672435  0.745782  0.205673  0.365278   0.50309
4    0.927983  0.108087  0.215371  0.973301  0.954185
..        ...       ...       ...       ...       ...
329  0.513331  0.652737  0.420129  0.173063  0.502039
330  0.067650  0.288891  0.321769  0.815929  0.968483
331  0.608006  0.178982  0.279600  0.499660  0.752156
332  0.657410  0.415771  0.974737  0.707983  0.554809
333  0.816938  0.704478  0.619618  0.108440  0.284959

[334 rows x 5 columns]

In [61]:
new_df2 = new_df

In [62]:
new_df2[0][0] = 678

In [63]:
new_df

            0         1         2         3         4
0         678  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [64]:
new_df2

            0         1         2         3         4
0         678  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [65]:
new_df3 = new_df2.copy()

In [66]:
new_df3[0][0] = 'Ashish'

C:\Users\user\AppData\Local\Temp\ipykernel_9500\3695739475.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_df3[0][0] = 'Ashish'
C:\Users\user\AppData\Local\Temp\ipykernel_9500\3695739475.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df3[0][0] = 'Ashish'

In [67]:
new_df3

            0         1         2         3         4
0      Ashish  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [68]:
new_df2

            0         1         2         3         4
0         678  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [69]:
new_df4 = new_df2[:]

In [70]:
new_df4[0][0] = 0.3456

C:\Users\user\AppData\Local\Temp\ipykernel_9500\1658468479.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_df4[0][0] = 0.3456
C:\Users\user\AppData\Local\Temp\ipykernel_9500\1658468479.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df4[0][0] = 0.3456

In [71]:
new_df4

            0         1         2         3         4
0      0.3456  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [72]:
new_df2

            0         1         2         3         4
0      0.3456  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [73]:
new_df

            0         1         2         3         4
0      0.3456  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [74]:
new_df.loc[0, 0] = 890

In [75]:
new_df

            0         1         2         3         4
0         890  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [76]:
# code to change the column name
new_df.columns = list('abcde')

In [77]:
new_df

            a         b         c         d         e
0         890  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [78]:
new_df.index = np.arange(334)

In [79]:
new_df

            a         b         c         d         e
0         890  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [80]:
new_df.columns = ['A', 'B', 'C', 'D', 'E']

In [81]:
new_df

            A         B         C         D         E
0         890  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [82]:
new_df.loc[0, 'A'] = 'Ashish Kumar'

In [83]:
new_df

                A         B         C         D         E
0    Ashish Kumar  0.582689  0.586726  0.972259  0.002079
1        0.192804  0.440983  0.033614  0.968491  0.237070
2        0.485397  0.128921  0.705564  0.628725  0.961703
3         0.50309  0.365278  0.205673  0.745782  0.672435
4        0.954185  0.973301  0.215371  0.108087  0.927983
..            ...       ...       ...       ...       ...
329      0.502039  0.173063  0.420129  0.652737  0.513331
330      0.968483  0.815929  0.321769  0.288891  0.067650
331      0.752156  0.499660  0.279600  0.178982  0.608006
332      0.554809  0.707983  0.974737  0.415771  0.657410
333      0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [84]:
new_df.loc[0, 0] = 567

In [85]:
new_df

                A         B         C         D         E      0
0    Ashish Kumar  0.582689  0.586726  0.972259  0.002079  567.0
1        0.192804  0.440983  0.033614  0.968491  0.237070    NaN
2        0.485397  0.128921  0.705564  0.628725  0.961703    NaN
3         0.50309  0.365278  0.205673  0.745782  0.672435    NaN
4        0.954185  0.973301  0.215371  0.108087  0.927983    NaN
..            ...       ...       ...       ...       ...    ...
329      0.502039  0.173063  0.420129  0.652737  0.513331    NaN
330      0.968483  0.815929  0.321769  0.288891  0.067650    NaN
331      0.752156  0.499660  0.279600  0.178982  0.608006    NaN
332      0.554809  0.707983  0.974737  0.415771  0.657410    NaN
333      0.284959  0.108440  0.619618  0.704478  0.816938    NaN

[334 rows x 6 columns]

In [86]:
# code to drop a column in the dataframe.
new_df.drop(0, axis=1)

                A         B         C         D         E
0    Ashish Kumar  0.582689  0.586726  0.972259  0.002079
1        0.192804  0.440983  0.033614  0.968491  0.237070
2        0.485397  0.128921  0.705564  0.628725  0.961703
3         0.50309  0.365278  0.205673  0.745782  0.672435
4        0.954185  0.973301  0.215371  0.108087  0.927983
..            ...       ...       ...       ...       ...
329      0.502039  0.173063  0.420129  0.652737  0.513331
330      0.968483  0.815929  0.321769  0.288891  0.067650
331      0.752156  0.499660  0.279600  0.178982  0.608006
332      0.554809  0.707983  0.974737  0.415771  0.657410
333      0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [87]:
new_df

                A         B         C         D         E      0
0    Ashish Kumar  0.582689  0.586726  0.972259  0.002079  567.0
1        0.192804  0.440983  0.033614  0.968491  0.237070    NaN
2        0.485397  0.128921  0.705564  0.628725  0.961703    NaN
3         0.50309  0.365278  0.205673  0.745782  0.672435    NaN
4        0.954185  0.973301  0.215371  0.108087  0.927983    NaN
..            ...       ...       ...       ...       ...    ...
329      0.502039  0.173063  0.420129  0.652737  0.513331    NaN
330      0.968483  0.815929  0.321769  0.288891  0.067650    NaN
331      0.752156  0.499660  0.279600  0.178982  0.608006    NaN
332      0.554809  0.707983  0.974737  0.415771  0.657410    NaN
333      0.284959  0.108440  0.619618  0.704478  0.816938    NaN

[334 rows x 6 columns]

In [88]:
new_df.loc[0, 0] = 768

In [89]:
new_df

                A         B         C         D         E      0
0    Ashish Kumar  0.582689  0.586726  0.972259  0.002079  768.0
1        0.192804  0.440983  0.033614  0.968491  0.237070    NaN
2        0.485397  0.128921  0.705564  0.628725  0.961703    NaN
3         0.50309  0.365278  0.205673  0.745782  0.672435    NaN
4        0.954185  0.973301  0.215371  0.108087  0.927983    NaN
..            ...       ...       ...       ...       ...    ...
329      0.502039  0.173063  0.420129  0.652737  0.513331    NaN
330      0.968483  0.815929  0.321769  0.288891  0.067650    NaN
331      0.752156  0.499660  0.279600  0.178982  0.608006    NaN
332      0.554809  0.707983  0.974737  0.415771  0.657410    NaN
333      0.284959  0.108440  0.619618  0.704478  0.816938    NaN

[334 rows x 6 columns]

In [91]:
# Code to drop zero rows from a dataframe
new_df.drop(0)

            A         B         C         D         E   0
1    0.192804  0.440983  0.033614  0.968491  0.237070 NaN
2    0.485397  0.128921  0.705564  0.628725  0.961703 NaN
3     0.50309  0.365278  0.205673  0.745782  0.672435 NaN
4    0.954185  0.973301  0.215371  0.108087  0.927983 NaN
5    0.871531  0.563333  0.038668  0.503785  0.032088 NaN
..        ...       ...       ...       ...       ...  ..
329  0.502039  0.173063  0.420129  0.652737  0.513331 NaN
330  0.968483  0.815929  0.321769  0.288891  0.067650 NaN
331  0.752156  0.499660  0.279600  0.178982  0.608006 NaN
332  0.554809  0.707983  0.974737  0.415771  0.657410 NaN
333  0.284959  0.108440  0.619618  0.704478  0.816938 NaN

[333 rows x 6 columns]

In [92]:
new_df

                A         B         C         D         E      0
0    Ashish Kumar  0.582689  0.586726  0.972259  0.002079  768.0
1        0.192804  0.440983  0.033614  0.968491  0.237070    NaN
2        0.485397  0.128921  0.705564  0.628725  0.961703    NaN
3         0.50309  0.365278  0.205673  0.745782  0.672435    NaN
4        0.954185  0.973301  0.215371  0.108087  0.927983    NaN
..            ...       ...       ...       ...       ...    ...
329      0.502039  0.173063  0.420129  0.652737  0.513331    NaN
330      0.968483  0.815929  0.321769  0.288891  0.067650    NaN
331      0.752156  0.499660  0.279600  0.178982  0.608006    NaN
332      0.554809  0.707983  0.974737  0.415771  0.657410    NaN
333      0.284959  0.108440  0.619618  0.704478  0.816938    NaN

[334 rows x 6 columns]

In [93]:
# code to drop zero column from dataframe
new_df.drop(0, axis=1)

                A         B         C         D         E
0    Ashish Kumar  0.582689  0.586726  0.972259  0.002079
1        0.192804  0.440983  0.033614  0.968491  0.237070
2        0.485397  0.128921  0.705564  0.628725  0.961703
3         0.50309  0.365278  0.205673  0.745782  0.672435
4        0.954185  0.973301  0.215371  0.108087  0.927983
..            ...       ...       ...       ...       ...
329      0.502039  0.173063  0.420129  0.652737  0.513331
330      0.968483  0.815929  0.321769  0.288891  0.067650
331      0.752156  0.499660  0.279600  0.178982  0.608006
332      0.554809  0.707983  0.974737  0.415771  0.657410
333      0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [94]:
new_df.head()

              A         B         C         D         E      0
0  Ashish Kumar  0.582689  0.586726  0.972259  0.002079  768.0
1      0.192804  0.440983  0.033614  0.968491  0.237070    NaN
2      0.485397  0.128921  0.705564  0.628725  0.961703    NaN
3       0.50309  0.365278  0.205673  0.745782  0.672435    NaN
4      0.954185  0.973301  0.215371  0.108087  0.927983    NaN

In [95]:
# code to affect the changes in the dataframe also.
new_df = new_df.drop(0, axis=1)

In [96]:
new_df

                A         B         C         D         E
0    Ashish Kumar  0.582689  0.586726  0.972259  0.002079
1        0.192804  0.440983  0.033614  0.968491  0.237070
2        0.485397  0.128921  0.705564  0.628725  0.961703
3         0.50309  0.365278  0.205673  0.745782  0.672435
4        0.954185  0.973301  0.215371  0.108087  0.927983
..            ...       ...       ...       ...       ...
329      0.502039  0.173063  0.420129  0.652737  0.513331
330      0.968483  0.815929  0.321769  0.288891  0.067650
331      0.752156  0.499660  0.279600  0.178982  0.608006
332      0.554809  0.707983  0.974737  0.415771  0.657410
333      0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [97]:
new_df.head()

              A         B         C         D         E
0  Ashish Kumar  0.582689  0.586726  0.972259  0.002079
1      0.192804  0.440983  0.033614  0.968491  0.237070
2      0.485397  0.128921  0.705564  0.628725  0.961703
3       0.50309  0.365278  0.205673  0.745782  0.672435
4      0.954185  0.973301  0.215371  0.108087  0.927983

In [98]:
# code to get some specific row and column.
new_df.loc[1, 'A']

0.1928038398688422

In [100]:
# code to get 1 and 2 rows and C column from a dataframe.
new_df.loc[[1,2], 'C']

1    0.033614
2    0.705564
Name: C, dtype: float64

In [101]:
new_df.loc[[1, 2], ['C', 'D']]

          C         D
1  0.033614  0.968491
2  0.705564  0.628725

In [103]:
# code to get all the rows from the dataframe and column C and D
new_df.loc[:, ['C', 'D']]

            C         D
0    0.586726  0.972259
1    0.033614  0.968491
2    0.705564  0.628725
3    0.205673  0.745782
4    0.215371  0.108087
..        ...       ...
329  0.420129  0.652737
330  0.321769  0.288891
331  0.279600  0.178982
332  0.974737  0.415771
333  0.619618  0.704478

[334 rows x 2 columns]

In [104]:
# code to get 1 and 2 rows with all the columns.
new_df.loc[[1, 2], :]

          A         B         C         D         E
1  0.192804  0.440983  0.033614  0.968491  0.237070
2  0.485397  0.128921  0.705564  0.628725  0.961703

In [105]:
new_df.loc[0, 0] = 0.23

In [106]:
new_df

                A         B         C         D         E     0
0    Ashish Kumar  0.582689  0.586726  0.972259  0.002079  0.23
1        0.192804  0.440983  0.033614  0.968491  0.237070   NaN
2        0.485397  0.128921  0.705564  0.628725  0.961703   NaN
3         0.50309  0.365278  0.205673  0.745782  0.672435   NaN
4        0.954185  0.973301  0.215371  0.108087  0.927983   NaN
..            ...       ...       ...       ...       ...   ...
329      0.502039  0.173063  0.420129  0.652737  0.513331   NaN
330      0.968483  0.815929  0.321769  0.288891  0.067650   NaN
331      0.752156  0.499660  0.279600  0.178982  0.608006   NaN
332      0.554809  0.707983  0.974737  0.415771  0.657410   NaN
333      0.284959  0.108440  0.619618  0.704478  0.816938   NaN

[334 rows x 6 columns]

In [109]:
new_df = new_df.drop(0, axis=1)

In [110]:
new_df

                A         B         C         D         E
0    Ashish Kumar  0.582689  0.586726  0.972259  0.002079
1        0.192804  0.440983  0.033614  0.968491  0.237070
2        0.485397  0.128921  0.705564  0.628725  0.961703
3         0.50309  0.365278  0.205673  0.745782  0.672435
4        0.954185  0.973301  0.215371  0.108087  0.927983
..            ...       ...       ...       ...       ...
329      0.502039  0.173063  0.420129  0.652737  0.513331
330      0.968483  0.815929  0.321769  0.288891  0.067650
331      0.752156  0.499660  0.279600  0.178982  0.608006
332      0.554809  0.707983  0.974737  0.415771  0.657410
333      0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [111]:
new_df.loc[0, 'A'] = 0.34

In [112]:
new_df

            A         B         C         D         E
0        0.34  0.582689  0.586726  0.972259  0.002079
1    0.192804  0.440983  0.033614  0.968491  0.237070
2    0.485397  0.128921  0.705564  0.628725  0.961703
3     0.50309  0.365278  0.205673  0.745782  0.672435
4    0.954185  0.973301  0.215371  0.108087  0.927983
..        ...       ...       ...       ...       ...
329  0.502039  0.173063  0.420129  0.652737  0.513331
330  0.968483  0.815929  0.321769  0.288891  0.067650
331  0.752156  0.499660  0.279600  0.178982  0.608006
332  0.554809  0.707983  0.974737  0.415771  0.657410
333  0.284959  0.108440  0.619618  0.704478  0.816938

[334 rows x 5 columns]

In [113]:
new_df.loc[1]

A    0.192804
B    0.440983
C    0.033614
D    0.968491
E     0.23707
Name: 1, dtype: object

In [116]:
# code to get the rows whose column A value is less than 0.3
new_df.loc[new_df['A'] < 0.3, :]

            A         B         C         D         E
1    0.192804  0.440983  0.033614  0.968491  0.237070
6    0.071561  0.094675  0.133739  0.961463  0.443363
13   0.050216  0.349157  0.271600  0.784116  0.619610
17   0.178632  0.754020  0.448909  0.994045  0.803604
22   0.191231  0.637273  0.543365  0.402262  0.662312
..        ...       ...       ...       ...       ...
296  0.042689  0.760160  0.125951  0.995795  0.097853
320  0.100499  0.307519  0.345416  0.052323  0.954211
321  0.182637  0.862463  0.949936  0.720746  0.983032
325  0.138592  0.799727  0.159117  0.515144  0.794229
333  0.284959  0.108440  0.619618  0.704478  0.816938

[96 rows x 5 columns]